import classes from "./App.module.css";
import Header from "../shared/Header/Header.jsx";
import Footer from "../shared/Footer/Footer.jsx";
import { useNavigate } from "react-router-dom";

const Rates = [
  {
    logo: (
      <svg
        xmlns="http://www.w3.org/2000/svg"
        width="40"
        height="40"
        viewBox="0 0 40 40"
        fill="none"
      >
        <path
          d="M36.466 7.47824C36.9677 5.68672 37.2185 4.79096 36.9857 4.17628C36.7827 3.64035 36.3596 3.21724 35.8237 3.01427C35.209 2.78147 34.3133 3.03228 32.5218 3.53391L7.29584 10.5972C4.46617 11.3895 3.05133 11.7856 2.64136 12.4583C2.28678 13.0401 2.25275 13.7623 2.55106 14.3748C2.89597 15.0831 4.26729 15.6105 7.00993 16.6654L17.4725 20.6894C17.9614 20.8775 18.2058 20.9715 18.4114 21.1176C18.5936 21.2472 18.7528 21.4064 18.8823 21.5886C19.0285 21.7942 19.1225 22.0386 19.3105 22.5275L23.3344 32.9899C24.3892 35.7326 24.9166 37.1039 25.6248 37.4489C26.2374 37.7472 26.9596 37.7132 27.5414 37.3586C28.2141 36.9486 28.6102 35.5338 29.4026 32.7041L36.466 7.47824Z"
          stroke="#BF01C9"
          strokeWidth="4"
          strokeLinecap="round"
          strokeLinejoin="round"
        />
      </svg>
    ),
    name: "Стандарт",
    description: "Отправка любого груза по самой выгодной цене",
  },
  {
    logo: (
      <svg
        xmlns="http://www.w3.org/2000/svg"
        width="45"
        height="44"
        viewBox="0 0 45 44"
        fill="none"
      >
        <path
          d="M9.66746 19L2.66699 13.9998L7.24552 9.42173C8.13101 8.53632 8.57376 8.09361 9.09768 7.81381C9.5615 7.56609 10.0696 7.41226 10.5929 7.36111C11.1841 7.30334 11.798 7.42613 13.0259 7.67171L19.6672 8.99995M35.6681 25.0001L36.9974 31.6406C37.2432 32.8688 37.3662 33.4829 37.3084 34.0742C37.2573 34.5977 37.1035 35.106 36.8557 35.5699C36.5758 36.0939 36.1329 36.5368 35.2472 37.4224L30.6694 42L25.669 35M12.6667 31.9998L16.6667 28.0001M32.6729 15.9991C32.6729 18.2082 30.8819 19.9991 28.6726 19.9991C26.4634 19.9991 24.6724 18.2082 24.6724 15.9991C24.6724 13.7899 26.4634 11.999 28.6726 11.999C30.8819 11.999 32.6729 13.7899 32.6729 15.9991ZM37.867 2L29.3169 2C28.3385 2 27.8494 2 27.389 2.11052C26.9808 2.20851 26.5907 2.37013 26.2328 2.58945C25.8291 2.83682 25.4832 3.18273 24.7914 3.87455L9.19172 19.4744C7.60763 21.0585 6.81558 21.8506 6.51883 22.7639C6.25781 23.5673 6.25783 24.4327 6.51888 25.2361C6.81566 26.1494 7.60774 26.9415 9.1919 28.5255L16.1417 35.4749C17.7258 37.0588 18.5178 37.8508 19.4311 38.1476C20.2345 38.4086 21.0999 38.4086 21.9032 38.1475C22.8165 37.8508 23.6085 37.0587 25.1926 35.4747L40.7925 19.8745C41.4843 19.1827 41.8302 18.8368 42.0776 18.4332C42.2969 18.0753 42.4585 17.6851 42.5565 17.277C42.667 16.8166 42.667 16.3274 42.667 15.3491L42.667 6.8C42.667 5.11984 42.667 4.27976 42.34 3.63803C42.0524 3.07354 41.5934 2.6146 41.029 2.32698C40.3872 2 39.5471 2 37.867 2Z"
          stroke="#BF01C9"
          strokeWidth="4"
          strokeLinecap="round"
          strokeLinejoin="round"
        />
      </svg>
    ),
    name: "Экспресс",
    description: "Приоритетная отгрузка и доставка с максимальной скоростью",
  },
  {
    logo: (
      <svg
        xmlns="http://www.w3.org/2000/svg"
        width="42"
        height="44"
        viewBox="0 0 42 44"
        fill="none"
      >
        <path
          d="M12.5078 17.4545L29.158 7.45455M20.833 22.9091L37.483 12.9091M20.833 22.9091L4.18301 12.9091M20.833 22.9091V41.0909M2.33301 15.651V28.349C2.33301 29.3484 2.33301 29.8481 2.47729 30.2964C2.60496 30.693 2.81387 31.0587 3.09069 31.3702C3.40354 31.7222 3.83398 31.976 4.69487 32.4837L18.3949 40.5623C19.2821 41.0855 19.7258 41.3471 20.1985 41.4494C20.6167 41.5399 21.0494 41.5399 21.4675 41.4494C21.9402 41.3471 22.3839 41.0855 23.2711 40.5623L36.9711 32.4837C37.832 31.976 38.2625 31.7222 38.5753 31.3702C38.8521 31.0587 39.0611 30.693 39.1887 30.2964C39.333 29.8481 39.333 29.3484 39.333 28.349V15.651C39.333 14.6516 39.333 14.1519 39.1887 13.7036C39.0611 13.307 38.8521 12.9413 38.5753 12.6298C38.2625 12.2778 37.832 12.024 36.9711 11.5163L23.2711 3.43772C22.3839 2.91451 21.9402 2.65291 21.4675 2.55062C21.0494 2.46012 20.6167 2.46012 20.1985 2.55062C19.7258 2.65291 19.2821 2.91451 18.3949 3.43772L4.69487 11.5163C3.83398 12.024 3.40354 12.2778 3.09069 12.6298C2.81387 12.9413 2.60496 13.307 2.47729 13.7036C2.33301 14.1519 2.33301 14.6516 2.33301 15.651Z"
          stroke="#BF01C9"
          strokeWidth="4"
          strokeLinecap="round"
          strokeLinejoin="round"
        />
      </svg>
    ),
    name: "Максимум",
    description: "Доставка габаритных и тяжелых грузов ",
  },
];

export default function Main() {
  let navigate = useNavigate();
  return (
    <div className={classes.main}>
      <Header />

      <div className={classes.Advertisement}>
        <div className={classes.left}>
          <p className={classes.title}>Космический лифт</p>
          <p className={classes.description}>
            Забудьте о сложностях запусков и ракет. Мы поднимаем ваши грузы с
            Земли на орбиту быстро, безопасно и по выгодным ценам
          </p>
          <div className={classes.btns}>
            <button
              onClick={() => {
                navigate("/packages");
              }}
              className={classes.BtnTest}
            >
              Попробовать
            </button>
            <button
              onClick={() => {
                window.location = "https://cyberdom.moscow/spaces";
              }}
              className={classes.Detailed}
            >
              Подробнее
            </button>
          </div>
        </div>
        <img src="/mainpage1.png" alt="No image" />
      </div>

      <div className={classes.Choose}>
        <img src="/mainpage2.png" alt="No image" />
        <div className={classes.ChoosenText}>
          <p className={classes.title}>Нас выбирают</p>
          <p className={classes.description}>
            С космолифтом космос становится ближе и доступнее: ваш груз
            поднимается на орбиту без сложностей, без ожиданий и без лишних
            затрат Мы объединили удобство, надежность и заботу об экологии,
            чтобы каждая миссия была шагом в будущее.
          </p>
        </div>
      </div>

      <div className={classes.Rate}>
        <p className={classes.title}>Тарифы</p>
        <div className={classes.Rates}>
          {Rates.map((item, i) => (
            <Plans data={item} key={i} />
          ))}
        </div>
      </div>
      <Footer />
    </div>
  );
}

const Plans = ({ data }) => {
  const logo = data.logo;
  const name = data.name;
  const description = data.description;
  return (
    <div className={classes.Plan}>
      <p className={classes.titles}>
        {logo} {name}
      </p>
      <p className={classes.description}>{description}</p>
      <button className={classes.Test}>Попробовать</button>
    </div>
  );
};
